<div class="popup-wrapper news-popup">
    <div class="popup-container">
        <section class="popup-block">
            <h3 class="popup-block__header">У нас обновления...</h3>
            <p class="popup-block__text">Мы обновляем наш сайт. Пока что он работает в демо режиме и некоторые страницы и разделы могут быть недоступны. Совсем скоро мы завершим технические работы и весь функционал станет доступен. Некоторые изображения растений могут не соответствовать описанию товара, пока сайт находится в разработке. Приносим извинения за временные трудности.<br>Актуальную информацию по товарам можете уточнить у менеджеров по телефону +7&nbsp;(921)&nbsp;886-33-66</p>
            <button class="popup-block__btn js-close-popup" type="button">Хорошо</button>
        </section>
    </div>
</div>