<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="theme-color" content="#242424" media="(prefers-color-scheme: dark)">
    <meta name="format-detection" content="telephone=no">
    <title>Сад</title>
    <link rel="shortcut icon" href="" type="">
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Inter:wght@300;400;500;600;800&display=swap" rel="stylesheet">
    <link rel="stylesheet" href="main.css">
</head>

<body class="body" id="body">
    <?php
    $header_color = 'black';
    require_once "assets/views/includes/header.php";
    require_once "assets/views/includes/order-popup.php";
    require_once "assets/views/includes/breadcrumb.php"; ?>
    <div class="wrapper">
        <?php get_breadcrumb(["<a href='#'>Корзина</a>", "<p>Оформление заказа</p>"]); ?>
        <main class="order-page">
            <h1 class="order-page__header">оформление заказа</h1>
            <section class="order-page__container">
                <form class="order-page__form">
                    <div class="input-container name-input">
                        <label for="order-name">Ваше имя</label>
                        <input type="text" class="validate-input" data-type="text" placeholder="Имя" id="order-name" name="name">
                    </div>
                    <div class="form-row">
                        <div class="input-container">
                            <label for="order-phone">Номер телефона</label>
                            <input class="validate-input telephone-input" data-type="telephone" type="text" placeholder="Номер телефона" id="order-phone" name="phone">
                        </div>
                        <div class="input-container">
                            <label for="order-email">E-mail</label>
                            <input type="text" class="validate-input" data-type="email" placeholder="E-mail" id="order-email" name="email">
                        </div>
                    </div>
                    <div class="delivery-block">
                        <p class="delivery-block__header">Способ доставки</p>
                        <div class="input-row">
                            <div class="radio-input delivery-choice js-address-delivery-option" data-tab="delivery">
                                <input class="js-address-delivery-input" type="radio" name="delivery" id="delivery-1" value="address_delivery">
                                <label for="delivery-1">
                                    <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M6 12V26.6552C6 27.2075 6.44772 27.6552 7 27.6552H8.23169C8.78404 26.1076 10.2627 25 12 25C13.7373 25 15.216 26.1076 15.7683 27.6552H22.7414C23.2937 27.6552 23.7414 27.2075 23.7414 26.6552V12C23.7414 11.4477 23.2937 11 22.7414 11H7C6.44771 11 6 11.4477 6 12Z" fill="#7E899A" />
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M29.8059 16.0684H23.6562C23.104 16.0684 22.6562 16.5161 22.6562 17.0684V27.6546H24.2329C24.7854 26.1073 26.2639 25 28.001 25C29.7381 25 31.2166 26.1073 31.7691 27.6546H34.3287C34.8809 27.6546 35.3287 27.2069 35.3287 26.6546V22.6825C35.1546 22.845 34.9198 22.948 34.6488 22.948H30.8977C30.3455 22.948 29.8977 22.5003 29.8977 21.948V20.3273C29.8977 19.775 30.3455 19.3273 30.8977 19.3273H33.1113L30.5585 16.4099C30.3686 16.1928 30.0943 16.0684 29.8059 16.0684Z" fill="#7E899A" />
                                        <circle cx="12" cy="29" r="3" fill="#7E899A" />
                                        <circle cx="28" cy="29" r="3" fill="#7E899A" />
                                    </svg>
                                    <span>Доставка до адреса</span>
                                </label>
                            </div>
                            <div class="radio-input delivery-choice" data-tab="pickup">
                                <input class="js-pickup-option" type="radio" name="delivery" id="delivery-2" value="courier">
                                <label for="delivery-2">
                                    <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M33.6255 27.0171L18.1707 31.1582L11.8296 7.49301L7 8.78711" stroke="#7E899A" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M17.6416 21.464L19.1945 27.2595C19.3375 27.793 19.8858 28.1096 20.4193 27.9666L30.0785 25.3784C30.612 25.2355 30.9286 24.6872 30.7857 24.1537L29.2327 18.3581C29.0898 17.8247 28.5415 17.5081 28.008 17.651L18.3487 20.2392C17.8153 20.3822 17.4987 20.9305 17.6416 21.464ZM21.8289 21.6361C21.4288 21.7433 21.1913 22.1546 21.2985 22.5547C21.4057 22.9548 21.817 23.1922 22.2171 23.085L26.0808 22.0497C26.4809 21.9425 26.7183 21.5313 26.6111 21.1312C26.5039 20.7311 26.0927 20.4936 25.6926 20.6008L21.8289 21.6361Z" fill="#7E899A" />
                                        <path d="M19.1945 27.2595L19.6775 27.1301L19.1945 27.2595ZM17.6416 21.464L17.1587 21.5934L17.6416 21.464ZM21.8289 21.6361L21.6994 21.1531L21.8289 21.6361ZM25.6926 20.6008L25.822 21.0838L25.6926 20.6008ZM19.6775 27.1301L18.1246 21.3346L17.1587 21.5934L18.7116 27.3889L19.6775 27.1301ZM20.2899 27.4837C20.0231 27.5551 19.749 27.3969 19.6775 27.1301L18.7116 27.3889C18.926 28.1891 19.7485 28.664 20.5487 28.4496L20.2899 27.4837ZM29.9491 24.8955L20.2899 27.4837L20.5487 28.4496L30.208 25.8614L29.9491 24.8955ZM30.3027 24.2831C30.3742 24.5498 30.2159 24.824 29.9491 24.8955L30.208 25.8614C31.0082 25.647 31.483 24.8245 31.2686 24.0243L30.3027 24.2831ZM28.7498 18.4876L30.3027 24.2831L31.2686 24.0243L29.7157 18.2287L28.7498 18.4876ZM28.1374 18.134C28.4041 18.0625 28.6783 18.2208 28.7498 18.4876L29.7157 18.2287C29.5013 17.4285 28.6788 16.9537 27.8786 17.1681L28.1374 18.134ZM18.4781 20.7222L28.1374 18.134L27.8786 17.1681L18.2193 19.7563L18.4781 20.7222ZM18.1246 21.3346C18.0531 21.0678 18.2114 20.7937 18.4781 20.7222L18.2193 19.7563C17.4191 19.9707 16.9443 20.7932 17.1587 21.5934L18.1246 21.3346ZM21.7815 22.4253C21.7458 22.2919 21.8249 22.1548 21.9583 22.1191L21.6994 21.1531C21.0326 21.3318 20.6369 22.0172 20.8156 22.6841L21.7815 22.4253ZM22.0877 22.602C21.9543 22.6378 21.8172 22.5586 21.7815 22.4253L20.8156 22.6841C20.9942 23.3509 21.6797 23.7466 22.3465 23.568L22.0877 22.602ZM25.9514 21.5668L22.0877 22.602L22.3465 23.568L26.2102 22.5327L25.9514 21.5668ZM26.1282 21.2606C26.1639 21.3939 26.0847 21.531 25.9514 21.5668L26.2102 22.5327C26.877 22.354 27.2728 21.6686 27.0941 21.0017L26.1282 21.2606ZM25.822 21.0838C25.9553 21.0481 26.0924 21.1272 26.1282 21.2606L27.0941 21.0017C26.9154 20.3349 26.23 19.9392 25.5632 20.1179L25.822 21.0838ZM21.9583 22.1191L25.822 21.0838L25.5632 20.1179L21.6994 21.1531L21.9583 22.1191Z" fill="#7E899A" />
                                        <circle cx="17.3344" cy="31.8987" r="3" transform="rotate(-15 17.3344 31.8987)" fill="#7E899A" />
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M15.3135 12.7706L16.8664 18.5662C17.0094 19.0996 17.5577 19.4162 18.0912 19.2733L27.7504 16.6851C28.2839 16.5421 28.6005 15.9938 28.4575 15.4603L26.9046 9.66478C26.7617 9.13132 26.2133 8.81474 25.6799 8.95768L16.0206 11.5459C15.4871 11.6888 15.1706 12.2371 15.3135 12.7706ZM19.5007 12.9427C19.1006 13.05 18.8632 13.4612 18.9704 13.8613C19.0776 14.2614 19.4889 14.4988 19.889 14.3916L23.7527 13.3564C24.1528 13.2492 24.3902 12.8379 24.283 12.4378C24.1758 12.0377 23.7645 11.8003 23.3644 11.9075L19.5007 12.9427Z" fill="#7E899A" />
                                    </svg>
                                    <span>Самовывоз</span>
                                </label>
                            </div>
                        </div>
                        <div class="delivery-page">
                            <p class="text">Доставка осуществляется при заказе более чем на 5000 ₽, подробнее об условиях можно узнать в разделе <a href="#" class="underline">Доставка&nbsp;и&nbsp;оплата</a></p>
                            <div class="input-container">
                                <label for="address">Адрес доставки</label>
                                <input type="text" class="validate-input" data-type="text" name="address" placeholder="Адрес" id="address">
                            </div>
                            <div class="comment">
                                <label for="comment">Комментарий</label>
                                <textarea name="comment" id="comment"></textarea>
                            </div>
                        </div>
                        <div class="pickup-page hidden">
                            <p class="label-text">Выберите адрес</p>
                            <div class="radio-input pickup-item">
                                <input type="radio" name="pickup" id="pickup-1" value="address1" checked>
                                <label for="pickup-1">
                                    <p>г. Санкт-Петербург, Всеволожский район, 11 км. Новоприозерского шоссе </p>
                                    <a href="#" class="pickup-item__show-map">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M17.5008 16.4999L12.0008 21.9999L6.50083 16.4999C3.46327 13.4623 3.46326 8.53742 6.50083 5.49985C9.53839 2.46229 14.4633 2.46229 17.5008 5.49985C20.5384 8.53742 20.5384 13.4623 17.5008 16.4999ZM12.001 15C14.2101 15 16.001 13.2091 16.001 11C16.001 8.79086 14.2101 7 12.001 7C9.79184 7 8.00098 8.79086 8.00098 11C8.00098 13.2091 9.79184 15 12.001 15Z" fill="#3E683A" />
                                            <path d="M12.0008 21.9999L11.4705 22.5302C11.6112 22.6708 11.8019 22.7499 12.0008 22.7499C12.1997 22.7499 12.3905 22.6708 12.5312 22.5302L12.0008 21.9999ZM17.5008 16.4999L18.0312 17.0302L17.5008 16.4999ZM6.50083 16.4999L7.03116 15.9695H7.03116L6.50083 16.4999ZM6.50083 5.49985L5.9705 4.96952L5.9705 4.96952L6.50083 5.49985ZM17.5008 5.49985L16.9705 6.03018L17.5008 5.49985ZM12.5312 22.5302L18.0312 17.0302L16.9705 15.9695L11.4705 21.4695L12.5312 22.5302ZM5.9705 17.0302L11.4705 22.5302L12.5312 21.4695L7.03116 15.9695L5.9705 17.0302ZM5.9705 4.96952C2.64004 8.29998 2.64004 13.6997 5.9705 17.0302L7.03116 15.9695C4.28649 13.2249 4.28649 8.77486 7.03116 6.03018L5.9705 4.96952ZM18.0312 4.96952C14.7007 1.63907 9.30096 1.63907 5.9705 4.96952L7.03116 6.03018C9.77583 3.28551 14.2258 3.28551 16.9705 6.03018L18.0312 4.96952ZM18.0312 17.0302C21.3616 13.6997 21.3616 8.29998 18.0312 4.96952L16.9705 6.03018C19.7152 8.77486 19.7152 13.2248 16.9705 15.9695L18.0312 17.0302ZM15.251 11C15.251 12.7949 13.7959 14.25 12.001 14.25V15.75C14.6243 15.75 16.751 13.6234 16.751 11H15.251ZM12.001 7.75C13.7959 7.75 15.251 9.20507 15.251 11H16.751C16.751 8.37665 14.6243 6.25 12.001 6.25V7.75ZM8.75098 11C8.75098 9.20507 10.2061 7.75 12.001 7.75V6.25C9.37762 6.25 7.25098 8.37665 7.25098 11H8.75098ZM12.001 14.25C10.2061 14.25 8.75098 12.7949 8.75098 11H7.25098C7.25098 13.6234 9.37762 15.75 12.001 15.75V14.25Z" fill="#3E683A" />
                                        </svg>
                                        <span>Показать на карте</span>
                                    </a>
                                </label>
                            </div>
                            <div class="radio-input pickup-item">
                                <input type="radio" name="pickup" id="pickup-2" value="address2">
                                <label for="pickup-2">
                                    <p>г. Санкт-Петербург, Всеволожский район, 11 км. Новоприозерского шоссе </p>
                                    <a href="#" class="pickup-item__show-map">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M17.5008 16.4999L12.0008 21.9999L6.50083 16.4999C3.46327 13.4623 3.46326 8.53742 6.50083 5.49985C9.53839 2.46229 14.4633 2.46229 17.5008 5.49985C20.5384 8.53742 20.5384 13.4623 17.5008 16.4999ZM12.001 15C14.2101 15 16.001 13.2091 16.001 11C16.001 8.79086 14.2101 7 12.001 7C9.79184 7 8.00098 8.79086 8.00098 11C8.00098 13.2091 9.79184 15 12.001 15Z" fill="#3E683A" />
                                            <path d="M12.0008 21.9999L11.4705 22.5302C11.6112 22.6708 11.8019 22.7499 12.0008 22.7499C12.1997 22.7499 12.3905 22.6708 12.5312 22.5302L12.0008 21.9999ZM17.5008 16.4999L18.0312 17.0302L17.5008 16.4999ZM6.50083 16.4999L7.03116 15.9695H7.03116L6.50083 16.4999ZM6.50083 5.49985L5.9705 4.96952L5.9705 4.96952L6.50083 5.49985ZM17.5008 5.49985L16.9705 6.03018L17.5008 5.49985ZM12.5312 22.5302L18.0312 17.0302L16.9705 15.9695L11.4705 21.4695L12.5312 22.5302ZM5.9705 17.0302L11.4705 22.5302L12.5312 21.4695L7.03116 15.9695L5.9705 17.0302ZM5.9705 4.96952C2.64004 8.29998 2.64004 13.6997 5.9705 17.0302L7.03116 15.9695C4.28649 13.2249 4.28649 8.77486 7.03116 6.03018L5.9705 4.96952ZM18.0312 4.96952C14.7007 1.63907 9.30096 1.63907 5.9705 4.96952L7.03116 6.03018C9.77583 3.28551 14.2258 3.28551 16.9705 6.03018L18.0312 4.96952ZM18.0312 17.0302C21.3616 13.6997 21.3616 8.29998 18.0312 4.96952L16.9705 6.03018C19.7152 8.77486 19.7152 13.2248 16.9705 15.9695L18.0312 17.0302ZM15.251 11C15.251 12.7949 13.7959 14.25 12.001 14.25V15.75C14.6243 15.75 16.751 13.6234 16.751 11H15.251ZM12.001 7.75C13.7959 7.75 15.251 9.20507 15.251 11H16.751C16.751 8.37665 14.6243 6.25 12.001 6.25V7.75ZM8.75098 11C8.75098 9.20507 10.2061 7.75 12.001 7.75V6.25C9.37762 6.25 7.25098 8.37665 7.25098 11H8.75098ZM12.001 14.25C10.2061 14.25 8.75098 12.7949 8.75098 11H7.25098C7.25098 13.6234 9.37762 15.75 12.001 15.75V14.25Z" fill="#3E683A" />
                                        </svg>
                                        <span>Показать на карте</span>
                                    </a>
                                </label>
                            </div>
                        </div>
                        <div class="payment-block">
                            <p class="payment-block__header">Способ оплаты</p>
                            <div class="payment-block__container">
                                <div class="radio-input payment-choice" data-tab="">
                                    <input type="radio" name="payment" id="payment-1" value="cash" checked>
                                    <label for="payment-1">
                                        <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M3.8976 15.3917L7.00343 26.9828C7.02509 27.0636 7.05604 27.1395 7.09484 27.2095L7.09484 16.5137C7.09484 15.9614 7.54255 15.5137 8.09484 15.5137L32.918 15.5137L30.9435 8.14478C30.8006 7.61131 30.2522 7.29473 29.7188 7.43767L4.60471 14.167C4.07124 14.3099 3.75466 14.8582 3.8976 15.3917Z" fill="#7E899A" />
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M8.09375 18V30C8.09375 30.5523 8.54147 31 9.09375 31L35.0938 31C35.646 31 36.0938 30.5523 36.0938 30V18C36.0938 17.4477 35.646 17 35.0938 17H9.09375C8.54146 17 8.09375 17.4477 8.09375 18ZM18.838 24.704V25.79H19.72V26.72H18.838V27.728H19.72V29H20.974V27.728H23.8V26.72H20.974V25.79H22.972C23.02 25.79 23.104 25.788 23.224 25.784C23.348 25.78 23.484 25.766 23.632 25.742C24.352 25.634 24.894 25.346 25.258 24.878C25.622 24.406 25.804 23.82 25.804 23.12C25.804 22.656 25.724 22.234 25.564 21.854C25.404 21.47 25.162 21.152 24.838 20.9C24.518 20.648 24.116 20.484 23.632 20.408C23.484 20.384 23.348 20.37 23.224 20.366C23.104 20.362 23.02 20.36 22.972 20.36H20.974H20.572H19.72V24.704H18.838ZM20.974 24.704H22.924C22.988 24.704 23.066 24.702 23.158 24.698C23.254 24.69 23.356 24.67 23.464 24.638C23.832 24.546 24.1 24.364 24.268 24.092C24.44 23.82 24.526 23.506 24.526 23.15C24.526 22.93 24.49 22.714 24.418 22.502C24.35 22.286 24.238 22.098 24.082 21.938C23.93 21.774 23.724 21.662 23.464 21.602C23.364 21.574 23.262 21.558 23.158 21.554C23.054 21.546 22.976 21.542 22.924 21.542H20.974V24.704Z" fill="#7E899A" />
                                        </svg>
                                        <span>Наличными при получении</span>
                                    </label>
                                </div>
                                <div class="radio-input payment-choice" data-tab="">
                                    <input type="radio" name="payment" id="payment-4" value="online">
                                    <label for="payment-4">
                                        <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <mask id="path-1-inside-1_1619_55723" fill="white">
                                                <path fill-rule="evenodd" clip-rule="evenodd" d="M7 9.41211C5.89543 9.41211 5 10.3075 5 11.4121V14.6619H35V11.4121C35 10.3075 34.1046 9.41211 33 9.41211H7ZM35 18.1619H5V28.4121C5 29.5167 5.89543 30.4121 7 30.4121H33C34.1046 30.4121 35 29.5167 35 28.4121V18.1619ZM7.5293 21.6617C7.5293 21.1094 7.97701 20.6617 8.5293 20.6617H22.6469C23.1992 20.6617 23.6469 21.1094 23.6469 21.6617C23.6469 22.214 23.1992 22.6617 22.6469 22.6617H8.5293C7.97701 22.6617 7.5293 22.214 7.5293 21.6617ZM8.5293 24.1626C7.97701 24.1626 7.5293 24.6103 7.5293 25.1626C7.5293 25.7148 7.97701 26.1626 8.5293 26.1626H18.2352C18.7875 26.1626 19.2352 25.7148 19.2352 25.1626C19.2352 24.6103 18.7875 24.1626 18.2352 24.1626H8.5293Z" />
                                            </mask>
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M7 9.41211C5.89543 9.41211 5 10.3075 5 11.4121V14.6619H35V11.4121C35 10.3075 34.1046 9.41211 33 9.41211H7ZM35 18.1619H5V28.4121C5 29.5167 5.89543 30.4121 7 30.4121H33C34.1046 30.4121 35 29.5167 35 28.4121V18.1619ZM7.5293 21.6617C7.5293 21.1094 7.97701 20.6617 8.5293 20.6617H22.6469C23.1992 20.6617 23.6469 21.1094 23.6469 21.6617C23.6469 22.214 23.1992 22.6617 22.6469 22.6617H8.5293C7.97701 22.6617 7.5293 22.214 7.5293 21.6617ZM8.5293 24.1626C7.97701 24.1626 7.5293 24.6103 7.5293 25.1626C7.5293 25.7148 7.97701 26.1626 8.5293 26.1626H18.2352C18.7875 26.1626 19.2352 25.7148 19.2352 25.1626C19.2352 24.6103 18.7875 24.1626 18.2352 24.1626H8.5293Z" fill="#7E899A" />
                                            <path d="M5 14.6619H3.5V16.1619H5V14.6619ZM35 14.6619V16.1619H36.5V14.6619H35ZM5 18.1619V16.6619H3.5V18.1619H5ZM35 18.1619H36.5V16.6619H35V18.1619ZM6.5 11.4121C6.5 11.136 6.72386 10.9121 7 10.9121V7.91211C5.067 7.91211 3.5 9.47911 3.5 11.4121H6.5ZM6.5 14.6619V11.4121H3.5V14.6619H6.5ZM35 13.1619H5V16.1619H35V13.1619ZM33.5 11.4121V14.6619H36.5V11.4121H33.5ZM33 10.9121C33.2761 10.9121 33.5 11.136 33.5 11.4121H36.5C36.5 9.47911 34.933 7.91211 33 7.91211V10.9121ZM7 10.9121H33V7.91211H7V10.9121ZM5 19.6619H35V16.6619H5V19.6619ZM6.5 28.4121V18.1619H3.5V28.4121H6.5ZM7 28.9121C6.72386 28.9121 6.5 28.6883 6.5 28.4121H3.5C3.5 30.3451 5.067 31.9121 7 31.9121V28.9121ZM33 28.9121H7V31.9121H33V28.9121ZM33.5 28.4121C33.5 28.6883 33.2761 28.9121 33 28.9121V31.9121C34.933 31.9121 36.5 30.3451 36.5 28.4121H33.5ZM33.5 18.1619V28.4121H36.5V18.1619H33.5ZM8.5293 19.1617C7.14859 19.1617 6.0293 20.281 6.0293 21.6617H9.0293C9.0293 21.9379 8.80544 22.1617 8.5293 22.1617V19.1617ZM22.6469 19.1617H8.5293V22.1617H22.6469V19.1617ZM25.1469 21.6617C25.1469 20.281 24.0277 19.1617 22.6469 19.1617V22.1617C22.3708 22.1617 22.1469 21.9379 22.1469 21.6617H25.1469ZM22.6469 24.1617C24.0277 24.1617 25.1469 23.0424 25.1469 21.6617H22.1469C22.1469 21.3856 22.3708 21.1617 22.6469 21.1617V24.1617ZM8.5293 24.1617H22.6469V21.1617H8.5293V24.1617ZM6.0293 21.6617C6.0293 23.0424 7.14859 24.1617 8.5293 24.1617V21.1617C8.80544 21.1617 9.0293 21.3856 9.0293 21.6617H6.0293ZM9.0293 25.1626C9.0293 25.4387 8.80544 25.6626 8.5293 25.6626V22.6626C7.14859 22.6626 6.0293 23.7819 6.0293 25.1626H9.0293ZM8.5293 24.6626C8.80544 24.6626 9.0293 24.8864 9.0293 25.1626H6.0293C6.0293 26.5433 7.14858 27.6626 8.5293 27.6626V24.6626ZM18.2352 24.6626H8.5293V27.6626H18.2352V24.6626ZM17.7352 25.1626C17.7352 24.8864 17.959 24.6626 18.2352 24.6626V27.6626C19.6159 27.6626 20.7352 26.5433 20.7352 25.1626H17.7352ZM18.2352 25.6626C17.959 25.6626 17.7352 25.4387 17.7352 25.1626H20.7352C20.7352 23.7819 19.6159 22.6626 18.2352 22.6626V25.6626ZM8.5293 25.6626H18.2352V22.6626H8.5293V25.6626Z" fill="#7E899A" mask="url(#path-1-inside-1_1619_55723)" />
                                        </svg>
                                        <span>Оплата онлайн</span>
                                    </label>
                                </div>
                                <div class="radio-input payment-choice" data-tab="juridical">
                                    <input type="radio" name="payment" id="payment-5" value="juridical">
                                    <label for="payment-5">
                                        <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M9.59961 10V30C9.59961 31.6569 10.9428 33 12.5996 33H27.3996C29.0565 33 30.3996 31.6569 30.3996 30V15.6164C30.3996 14.8164 30.0801 14.0495 29.512 13.4862L23.8482 7.86979C23.2863 7.31262 22.5271 7 21.7358 7H12.5996C10.9428 7 9.59961 8.34315 9.59961 10ZM13.9786 16.4C13.4264 16.4 12.9786 16.8477 12.9786 17.4C12.9786 17.9523 13.4264 18.4 13.9786 18.4H26.0208C26.573 18.4 27.0208 17.9523 27.0208 17.4C27.0208 16.8477 26.573 16.4 26.0208 16.4H13.9786ZM12.9786 21.5607C12.9786 21.0084 13.4264 20.5607 13.9786 20.5607H26.0208C26.573 20.5607 27.0208 21.0084 27.0208 21.5607C27.0208 22.113 26.573 22.5607 26.0208 22.5607H13.9786C13.4264 22.5607 12.9786 22.113 12.9786 21.5607ZM13.9786 24.7205C13.4264 24.7205 12.9786 25.1682 12.9786 25.7205C12.9786 26.2728 13.4264 26.7205 13.9786 26.7205H26.0208C26.573 26.7205 27.0208 26.2728 27.0208 25.7205C27.0208 25.1682 26.573 24.7205 26.0208 24.7205H13.9786Z" fill="#7E899A" />
                                        </svg>
                                        <span>Для юр. лица</span>
                                    </label>
                                </div>
                                <div class="radio-input payment-choice" data-tab="">
                                    <input type="radio" name="payment" id="payment-2" value="credit-card">
                                    <label for="payment-2">
                                        <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M5 14V27C5 28.1046 5.89543 29 7 29H14V21C14 19.3431 15.3431 18 17 18H22V14C22 12.8954 21.1046 12 20 12H7C5.89543 12 5 12.8954 5 14Z" fill="#7E899A" />
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M17 19C15.8954 19 15 19.8954 15 21V22.5H34.8333V21C34.8333 19.8954 33.9379 19 32.8333 19H17ZM34.8333 24.8333H15V31C15 32.1046 15.8954 33 17 33H32.8333C33.9379 33 34.8333 32.1046 34.8333 31V24.8333ZM16.8333 27.1667C16.8333 26.8905 17.0572 26.6667 17.3333 26.6667H26.6667C26.9428 26.6667 27.1667 26.8905 27.1667 27.1667C27.1667 27.4428 26.9428 27.6667 26.6667 27.6667H17.3333C17.0572 27.6667 16.8333 27.4428 16.8333 27.1667ZM17.3333 29C17.0572 29 16.8333 29.2239 16.8333 29.5C16.8333 29.7761 17.0572 30 17.3333 30H23.75C24.0261 30 24.25 29.7761 24.25 29.5C24.25 29.2239 24.0261 29 23.75 29H17.3333Z" fill="#7E899A" />
                                            <path d="M9 12V9.5C9 7.01472 11.0147 5 13.5 5V5C15.9853 5 18 7.01472 18 9.5V12" stroke="#7E899A" stroke-width="1.5" />
                                        </svg>
                                        <span>Картой при получении</span>
                                    </label>
                                </div>
                                <div class="radio-input payment-choice" data-tab="">
                                    <input type="radio" name="payment" id="payment-3" value="transfer">
                                    <label for="payment-3">
                                        <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M7.83203 10H31.832C32.9366 10 33.832 10.8954 33.832 12V14V16V28C33.832 29.1046 32.9366 30 31.832 30H7.83203C6.72746 30 5.83203 29.1046 5.83203 28V16V14V12C5.83203 10.8954 6.72746 10 7.83203 10ZM24.6611 15.1301C24.2729 14.7373 23.6398 14.7335 23.2469 15.1217C22.8541 15.5099 22.8504 16.1431 23.2386 16.5359L25.6733 18.9997H11.5969C11.0446 18.9997 10.5969 19.4474 10.5969 19.9997C10.5969 20.552 11.0446 20.9997 11.5969 20.9997H25.6733L23.2386 23.4634C22.8504 23.8563 22.8541 24.4894 23.2469 24.8776C23.6398 25.2658 24.2729 25.2621 24.6611 24.8693L28.7788 20.7026C29.1637 20.313 29.1637 19.6863 28.7788 19.2968L24.6611 15.1301Z" fill="#7E899A" />
                                        </svg>
                                        <span>Перевод на карту </span>
                                    </label>
                                </div>
                                <div class="radio-input payment-choice" data-tab="credit">
                                    <input type="radio" name="payment" id="payment-6" value="credit">
                                    <label for="payment-6">
                                        <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M11.5996 7C10.495 7 9.59961 7.89543 9.59961 9V33L11.7859 31.1781C12.5276 30.56 13.605 30.56 14.3466 31.1781L16.5329 33L18.7192 31.1781C19.4609 30.56 20.5383 30.56 21.28 31.1781L23.4663 33L25.6526 31.1781C26.3943 30.56 27.4716 30.56 28.2133 31.1781L30.3996 33V9C30.3996 7.89543 29.5042 7 28.3996 7H11.5996ZM14.7996 12.0667C14.2473 12.0667 13.7996 12.5144 13.7996 13.0667C13.7996 13.619 14.2473 14.0667 14.7996 14.0667H25.1996C25.7519 14.0667 26.1996 13.619 26.1996 13.0667C26.1996 12.5144 25.7519 12.0667 25.1996 12.0667H14.7996ZM13.7996 18.2667C13.7996 17.7144 14.2473 17.2667 14.7996 17.2667H25.1996C25.7519 17.2667 26.1996 17.7144 26.1996 18.2667C26.1996 18.819 25.7519 19.2667 25.1996 19.2667H14.7996C14.2473 19.2667 13.7996 18.819 13.7996 18.2667ZM14.7996 22.4667C14.2473 22.4667 13.7996 22.9144 13.7996 23.4667C13.7996 24.019 14.2473 24.4667 14.7996 24.4667H25.1996C25.7519 24.4667 26.1996 24.019 26.1996 23.4667C26.1996 22.9144 25.7519 22.4667 25.1996 22.4667L14.7996 22.4667Z" fill="#7E899A" />
                                        </svg>
                                        <span>Рассрочка и кредитование</span>
                                    </label>
                                </div>
                            </div>
                            <div class="payment-method hidden" data-tab="juridical">
                                <div class="input-container">
                                    <label for="address">Наименование юр. лица</label>
                                    <input type="text" data-type="text" name="Юр. лицо" placeholder="Юр. лицо" id="address">
                                </div>
                                <div class="input-container">
                                    <label for="address">Юридический адрес</label>
                                    <input type="text" data-type="text" name="Юридический адрес" placeholder="Юридический адрес" id="address">
                                </div>
                                <div class="input-container">
                                    <label for="address">ИНН</label>
                                    <input type="text" data-type="text" name="ИНН" placeholder="ИНН" id="address">
                                </div>
                            </div>
                            <div class="payment-method hidden" data-tab="credit">
                                <div class="select-container credit-select-container">
                                    <label for="sort-select">Комфортный срок платежей</label>
                                    <select class="select custom-select credit-select" id="sort-select" name="credit-price">
                                        <option disabled>Выберите</option>
                                        <option value="3,10">3 месяца</option>
                                        <option value="6,10">6 месяца</option>
                                        <option value="12,10">12 месяца</option>
                                        <option value="24,10">24 месяца</option>
                                    </select>
                                </div>
                                <p class="credit-sum">Расчетная стоимость: <span class="credit-value">0</span> ₽/мес</p>
                                <button class="credit-button" type="button">Сохранить</button>
                            </div>
                        </div>
                    </div>
                </form>
                <div class="order-page__info">
                    <div class="order-page__info__row">
                        <p>Сумма заказа (2):</p>
                        <p><span class="order-sum">5000</span> ₽</p>
                    </div>
                    <div class="order-page__info__row">
                        <p>скидка:</p>
                        <p><span>0</span> ₽</p>
                    </div>
                    <button class="order-page__info__btn" type="button">
                        <?php
                        require "assets/views/includes/loading.php";
                        ?>
                        Оформить заказ</button>
                </div>
            </section>
        </main>
    </div>
    <?php require_once "assets/views/includes/footer.php" ?>
    <script src="main.js"></script>
</body>


</html>